# #DOGUSOTO CUSTOMER_RELATED AND SIFIR_ARAC DATASI (2)

In [1]:
import numpy as np
import pandas as pd

In [2]:
customer_rel = pd.read_csv('../datasets/FINAL_CUSTOMER_RELATED_TABLE_FOR_DATATHON.csv')
sifir_arac = pd.read_csv('../datasets/FINAL_SIFIR_ARAC_ALANLAR_DATATHON.csv')

# 3-) FINAL_CUSTOMER_RELATED_TABLE

## Genel Bilgiler

In [24]:
customer_rel

        BASE_CUSTOMER_ID  VEHICLE_ID  FK_RELATION_STATUS_ID
0                 189537     5321560                      2
1                 110802     5329278                      1
2                 160615     5329282                      1
3                 115664     5328513                      1
4                  81061     5322264                      1
...                  ...         ...                    ...
374858             22680     5172008                      1
374863            124954     5174101                      1
374865            167802     5174137                      1
374866            163801     5174147                      2
374871             93551     5188087                      2

[196538 rows x 3 columns]

In [22]:
customer_rel.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 196538 entries, 0 to 374871
Data columns (total 3 columns):
BASE_CUSTOMER_ID         196538 non-null int64
VEHICLE_ID               196538 non-null int64
FK_RELATION_STATUS_ID    196538 non-null int64
dtypes: int64(3)
memory usage: 6.0 MB

In [23]:
customer_rel.dtypes

BASE_CUSTOMER_ID         int64
VEHICLE_ID               int64
FK_RELATION_STATUS_ID    int64
dtype: object

In [5]:
customer_rel.isnull().sum()

Unnamed: 0                             0
BASE_CUSTOMER_ID                       0
VEHICLE_ID                             0
START_DATE                             0
END_DATE                          215122
FK_RELATION_STATUS_ID                  0
FK_RELATION_STATUS_EXPLANATION         0
dtype: int64

In [6]:
# Tüm tekrar edenleri saptadım.
customer_rel.duplicated('BASE_CUSTOMER_ID').sum()

# Tekrar edenler silindi.
customer_rel = customer_rel.drop_duplicates('BASE_CUSTOMER_ID')

In [7]:
customer_rel

,Unnamed: 0,BASE_CUSTOMER_ID,VEHICLE_ID,START_DATE,END_DATE,FK_RELATION_STATUS_ID,FK_RELATION_STATUS_EXPLANATION
0,0,189537,5321560,2018-07-24,2019-07-03,2,Pasif Ruhsat Sahibi
1,1,110802,5329278,2019-07-16,NaN,1,Aktif Ruhsat Sahibi
2,2,160615,5329282,2019-09-12,NaN,1,Aktif Ruhsat Sahibi
3,3,115664,5328513,2019-02-25,NaN,1,Aktif Ruhsat Sahibi
4,4,81061,5322264,2018-04-16,NaN,1,Aktif Ruhsat Sahibi
...,...,...,...,...,...,...,...
374858,374858,22680,5172008,2014-07-08,NaN,1,Aktif Ruhsat Sahibi
374863,374863,124954,5174101,2010-06-30,NaN,1,Aktif Ruhsat Sahibi
374865,374865,167802,5174137,2010-07-05,NaN,1,Aktif Ruhsat Sahibi
374866,374866,163801,5174147,2015-12-17,2017-04-01,2,Pasif Ruhsat Sahibi
374871,374871,93551,5188087,2019-06-26,2019-06-29,2,Pasif Ruhsat Sahibi

## Eşsizlik

In [8]:
pd.unique(customer_rel['START_DATE'])

array(['2018-07-24', '2019-07-16', '2019-09-12', ..., '2020-04-19',
       '2006-09-24', '2007-08-05'], dtype=object)

## Values

In [9]:
customer_rel['START_DATE'].value_counts(dropna=True)

2005-01-01    361
2007-03-19    231
2005-07-25    230
2005-05-23    191
2005-05-31    185
             ...
2015-06-28      1
1999-09-19      1
2002-01-08      1
2009-11-01      1
2017-02-12      1
Name: START_DATE, Length: 7877, dtype: int64

## Column Categorization

 - Gereksiz Sütunların Droplanması

In [ ]:
customer_rel = customer_rel.drop(['FK_RELATION_STATUS_EXPLANATION'], axis=1)

In [11]:
customer_rel = customer_rel.drop(columns=['Unnamed: 0'])

In [13]:
customer_rel = customer_rel.drop(columns=['START_DATE','END_DATE'])

In [14]:
customer_rel

        BASE_CUSTOMER_ID  VEHICLE_ID  FK_RELATION_STATUS_ID
0                 189537     5321560                      2
1                 110802     5329278                      1
2                 160615     5329282                      1
3                 115664     5328513                      1
4                  81061     5322264                      1
...                  ...         ...                    ...
374858             22680     5172008                      1
374863            124954     5174101                      1
374865            167802     5174137                      1
374866            163801     5174147                      2
374871             93551     5188087                      2

[196538 rows x 3 columns]

In [26]:
customer_rel.to_csv("customer_rel.csv", index=False)

# 4-) FINAL_SIFIR_ARAC_ALANLAR_DATATHON

## Genel Bilgiler

In [25]:
sifir_arac

        Unnamed: 0  VEHICLE_ID  CUSTOMER_ID          CREATE_DATE
0                0     5015193      1063740  2005-01-01 19:08:33
1                1     5110231      1155678  2005-09-29 17:16:15
2                2     5290356      1737831  2016-04-29 13:12:10
3                3     5344576      1841362  2021-03-16 13:39:01
4                4     5094010      1066916  2005-04-20 09:51:19
...            ...         ...          ...                  ...
169520      169520     5160829      1269016  2009-06-10 16:16:15
169521      169521     5098542      1157563  2005-08-01 12:07:57
169522      169522     5148086      1156732  2007-12-28 17:15:09
169523      169523     5263144      1032834  2015-06-24 11:19:15
169524      169524     5026911      1058351  2005-01-01 14:46:45

[169525 rows x 4 columns]

In [15]:
sifir_arac.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169525 entries, 0 to 169524
Data columns (total 4 columns):
Unnamed: 0     169525 non-null int64
VEHICLE_ID     169525 non-null int64
CUSTOMER_ID    169525 non-null int64
CREATE_DATE    169525 non-null object
dtypes: int64(3), object(1)
memory usage: 5.2+ MB

## Eşsizlik

In [27]:
pd.unique(sifir_arac['CREATE_DATE'])

array(['2005-01-01 19:08:33', '2005-09-29 17:16:15',
       '2016-04-29 13:12:10', ..., '2005-08-01 12:07:57',
       '2007-12-28 17:15:09', '2015-06-24 11:19:15'], dtype=object)

## Values

In [ ]:
## GEREK YOK.

## Column Categorization

In [ ]:
## GEREK YOK.

In [28]:
sifir_arac.to_csv("sifir_arac.csv", index=False)